pehill-5-cases-OpenFOAM/case_1p5/0/V
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.x                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      V;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 3 0 0 0 0 0];

internalField   nonuniform List<scalar> 
14751
(
4.41575e-05
4.41582e-05
4.41601e-05
4.41604e-05
4.41586e-05
4.4157e-05
4.41558e-05
4.41545e-05
...
)
;

boundaryField
{
    bottomWall
    {
        type            calculated;
        value           nonuniform List<scalar> 
99
(
0.0110394
0.0110401
0.0110648
0.0111753
0.0114647
0.0118831
0.0122687
0.0125501
...
)
;
    }
    defaultFaces
    {
        type            empty;
    }
    inlet
    {
        type            cyclic;
    }
    outlet
    {
        type            cyclic;
    }
    topWall
    {
        type            calculated;
        value           nonuniform List<scalar> 
99
(
0.0110394
0.0110394
0.0110394
0.0110394
0.0110394
0.0110394
0.0110394
0.0110394
...
)
;
    }
}


// ************************************************************************* //
